;; -*- no-byte-compile: t; -*-
;;; private/my/packages.el
(disable-packages! cmake-mode company-irony company-irony-c-headers flycheck-irony irony irony-eldoc ivy-rtags rtags lpy)


(package! company)
(package! company-quickhelp)
(package! lsp-mode)
(package! lsp-ui)
(package! company-lsp)

(package! ivy-yasnippet)

(package! window-numbering)
(package! iedit)
(package! symbol-overlay)
(package! electric)
